[
  {
    "id": 1,
    "content": "The main reason Yukiko dated Xander in the first place was to give him a reason not to turn evil via the book he had."
  },
  {
    "id": 2,
    "content": "Lucienna's favorite number is 2."
  },
  {
    "id": 3,
    "content": "Dennis was trained in martial arts, but dreamed of being good at throwing daggers, and practiced a lot. He didn't make much progress."
  },
  {
    "id": 4,
    "content": "Ikiru enjoys playing the pan pipes and dancing in her free time, and when noone is watching."
  },
  {
    "id": 5,
    "content": "Shiroe Pandora's closest friends are a stoic warforged, trying coming to come to terms with the realisation that he may or may not have a soul, and that that means, and a very silent girl of unknown origin who spends most of her time staring off into another dimension.\nHe masks the loneliness with his upbeat attitude and music."
  },
  {
    "id": 6,
    "content": "Shiroe Pandora's first name is Tavintir in origin, despite not having any ties to the place. It is also not pronounced the way it typically would be in Tavintir."
  },
  {
    "id": 7,
    "content": "Gary Everspell, Gary Flair, Ebernand Coytt, Yukiko, and Daria, once adventured together. Daria insists their party name was the Wizard Task Force. Everspell stalwartly refused once he realised the acronym."
  },
  {
    "id": 8,
    "content": "The Sakura Festival is an annual event held in Haruka. The Festival celebrates unity, peace, the end of the Pento-Cleros war and is in its fifth year. The main event is a famous tournament, wherein warriors from throughout the land gather to show their might and rebuild friendships between the kingdoms."
  },
  {
    "id": 9,
    "content": "Not much is known about the origins of the Great Phoenix Lake, however some legends say that a mighty Phoenix god was slain above what had yet to become Pento. Its body fell to the earth and the collision created a giant crater in its image. When it was reborn, its tears filled the crater to the brim, which is the lake we know today.\n\nWhat the Phoenix was mourning, however, nobody seems to know."
  },
  {
    "id": 10,
    "content": "Shiroe Pandora is a lolicon."
  }
]